---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData.LinkIndex
source: html/253e8b3b-a07b-f09e-428a-3c3cde3363e2.htm
---
# Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData.LinkIndex Property

the index of the connector which is linked with this connector

## Syntax (C#)
```csharp
public int LinkIndex { get; }
```